import random

left = [i for i in input('Введите отсутствующих людей\n').split()]

IT = [['Дереник', 'Паша З', 'Гриша', 'Вова', 'Дамир'],
      ['Дима', 'Эмир', 'Никита', 'Артём', 'Нарек'],
      [None, 'Коля', 'Миша Х', 'Миша П', 'Петя'],
      ['Максим', 'Саша Кол', None, None, None],
      ['Федя', 'Ярик', None, 'Ева', 'Полина'],
      ['Саша Коч', 'Илья', 'Глеб', 'Паша А', 'Венера']]

#ch = int(input('Введите номер ряда >>>'))
#v = int(input('Введите номер варианта >>>'))

print(IT)
      
